<a href='https://github.com/SeWonKwon' ><div> <img src ='https://slid-capture.s3.ap-northeast-2.amazonaws.com/public/image_upload/6556674324ed41a289a354258718280d/964e5a8b-75ad-41fc-ae75-0ca66d06fbc7.png' align='left' /> </div></a>

출처: https://www.w3resource.com/python-exercises/pandas/index-dataframe.php

In [1]:
import pandas as pd
import numpy as np

# 41. Write a Pandas program to convert DataFrame column type from string to datetime.    

    
```
Sample data:    

String Date:    
0 3/11/2000    
1 3/12/2000    
2 3/13/2000    
dtype: object    

Original DataFrame (string to datetime):    
0    
0 2000-03-11    
1 2000-03-12    
2 2000-03-13    
```

In [2]:
string_date = ['3/11/2000','3/12/2000', '3/13/2000']
df = pd.DataFrame(string_date, columns=["String Date"])

In [3]:
df['String Date'] = pd.to_datetime(df['String Date'])

In [4]:
df

  String Date
0  2000-03-11
1  2000-03-12
2  2000-03-13

# 42. Write a Pandas program to rename a specific column name in a given DataFrame.     

```
Sample data:    
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 9    

New DataFrame after renaming second column:    
col1 Column2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 9    
```

In [5]:
df = pd.DataFrame(np.random.randint(1,9,(3, 3)), columns=['col1','col2','col3'])
df

   col1  col2  col3
0     5     3     1
1     8     7     4
2     6     7     5

In [6]:
cols = df.columns.tolist()
cols[1] = 'Column2'
cols

['col1', 'Column2', 'col3']

In [7]:
df.columns = cols
df

   col1  Column2  col3
0     5        3     1
1     8        7     4
2     6        7     5

다른 정답

In [8]:
df.rename(columns={"col3":"C3"})

   col1  Column2  C3
0     5        3   1
1     8        7   4
2     6        7   5

#    
    
43. Write a Pandas program to get a list of a specified column of a DataFrame.     

```
Sample data:    
Powered by    
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 9    

Col2 of the DataFrame to list:    
[4, 5, 6]    
```

In [9]:
df = pd.DataFrame(np.random.randint(1,9,(3, 3)), columns=['col1','col2','col3'])
df

   col1  col2  col3
0     7     3     3
1     1     5     4
2     5     7     7

In [10]:
df.col2.tolist()

[3, 5, 7]

# ★ 44. Write a Pandas program to create a DataFrame from a Numpy array and specify the index column and column headers.     


Sample Output:    


```
Column1 Column2 Column3    
Index1 0 0.0 0.0    
Index2 0 0.0 0.0    
Index3 0 0.0 0.0    
.........    
Index12 0 0.0 0.0    
Index13 0 0.0 0.0    
Index14 0 0.0 0.0    
Index15 0 0.0 0.0    
```

In [11]:
data =np.zeros(15, dtype=[('Column1','int32'), ('Column2','float32'), ('Column3','float32')])
idx = ['Index'+str(x) for x in range(1, 16)]
df = pd.DataFrame(data, index=idx)
df

         Column1  Column2  Column3
Index1         0      0.0      0.0
Index2         0      0.0      0.0
Index3         0      0.0      0.0
Index4         0      0.0      0.0
Index5         0      0.0      0.0
Index6         0      0.0      0.0
Index7         0      0.0      0.0
Index8         0      0.0      0.0
Index9         0      0.0      0.0
Index10        0      0.0      0.0
Index11        0      0.0      0.0
Index12        0      0.0      0.0
Index13        0      0.0      0.0
Index14        0      0.0      0.0
Index15        0      0.0      0.0

# 45. Write a Pandas program to find the row for where the value of a given column is maximum.     


Sample Output:    


```
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 12    
3 4 9 1    
4 7 5 11    

Row where col1 has maximum value:    
4    

Row where col2 has maximum value:  
3    

Row where col3 has maximum value:    
2    
```

In [12]:
df = pd.DataFrame(np.random.randint(1,9,(5, 3)), columns=['col1','col2','col3'])
df

   col1  col2  col3
0     5     8     6
1     4     4     8
2     5     1     1
3     5     7     1
4     5     3     8

In [13]:
df.col1.argmax()

0

In [14]:
df.col2.argmax()

0

In [15]:
df.col3.argmax()

1

# 46. Write a Pandas program to check whether a given column is present in a DataFrame or not.     

```
Sample data:    

Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 12    
3 4 9 1    
4 7 5 11    
Col4 is not present in DataFrame.    
Col1 is present in DataFrame.

In [16]:
df = pd.DataFrame(np.random.randint(0,15, 15).reshape(5, 3), columns=['col1','col2','col3'])
df

   col1  col2  col3
0     6     5    10
1    13     7     7
2    14    13    13
3     5     3    12
4     0     6    11

In [17]:
'col4' in df.columns

False

In [18]:
'col1' in df.columns

True

# 47. Write a Pandas program to get the specified row value of a given DataFrame.     


Sample data:    

```
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 12    
3 4 9 1    
4 7 5 11    

Value of Row    
col1 1    
col2 4    
col3 7    
Name: 0, dtype: int64    

Value of Row4    
col1 4    
col2 9    
col3 1    
Name: 3, dtype: int64    
```

In [19]:
df = pd.DataFrame(np.random.randint(0,15, 15).reshape(5, 3), columns=['col1','col2','col3'], dtype=np.int64)
df

   col1  col2  col3
0    10    11    12
1     5     8     0
2     5    12    11
3     0     7    10
4     3     6    14

In [20]:
df.iloc[0]

col1    10
col2    11
col3    12
Name: 0, dtype: int64

In [21]:
df.iloc[4]

col1     3
col2     6
col3    14
Name: 4, dtype: int64

# 48. Write a Pandas program to get the datatypes of columns of a DataFrame.     


Sample data:    

```
Original DataFrame:    
attempts name qualify score    
0 1 Anastasia yes 12.5    
1 3 Dima no 9.0    
.......    
8 2 Kevin no 8.0    
9 1 Jonas yes 19.0    

Data types of the columns of the said DataFrame:    
attempts int64    
name object    
qualify object    
score float64    
dtype: object    
```

In [22]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [23]:
df.dtypes

name         object
score       float64
attempts      int64
qualify      object
dtype: object

# 49. Write a Pandas program to append data to an empty DataFrame.     

Sample data:    

```
Original DataFrame:    
After appending some data:    
col1 col2    
0 0 0    
1 1 1    
2 2 2    
```

In [24]:
df = pd.DataFrame(columns=['col1', 'col2'])
df

Empty DataFrame
Columns: [col1, col2]
Index: []

In [25]:
for i in range(3):
    df.loc[i] = i, i
df

  col1 col2
0    0    0
1    1    1
2    2    2

# 50. Write a Pandas program to sort a given DataFrame by two or more columns.     


Sample data:    

```
Original DataFrame:    
attempts name qualify score    
0 1 Anastasia yes 12.5    
1 3 Dima no 9.0    
........    
8 2 Kevin no 8.0    
9 1 Jonas yes 19.0    

Sort the above DataFrame on attempts, name:    
attempts name qualify score    
0 1 Anastasia yes 12.5    
9 1 Jonas yes 19.0    
7 1 Laura no NaN    
6 1 Matthew yes 14.5    
4 2 Emily no 9.0    
2 2 Katherine yes 16.5    
8 2 Kevin no 8.0    
1 3 Dima no 9.0    
3 3 James no NaN    
5 3 Michael yes 20.0    
```

In [26]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data, columns=['attempts', 'name', 'qualify', 'score'])
df

   attempts       name qualify  score
0         1  Anastasia     yes   12.5
1         3       Dima      no    9.0
2         2  Katherine     yes   16.5
3         3      James      no    NaN
4         2      Emily      no    9.0
5         3    Michael     yes   20.0
6         1    Matthew     yes   14.5
7         1      Laura      no    NaN
8         2      Kevin      no    8.0
9         1      Jonas     yes   19.0

In [27]:
df.sort_values(['attempts', 'name'])

   attempts       name qualify  score
0         1  Anastasia     yes   12.5
9         1      Jonas     yes   19.0
7         1      Laura      no    NaN
6         1    Matthew     yes   14.5
4         2      Emily      no    9.0
2         2  Katherine     yes   16.5
8         2      Kevin      no    8.0
1         3       Dima      no    9.0
3         3      James      no    NaN
5         3    Michael     yes   20.0

# 51. Write a Pandas program to convert the datatype of a given column (floats to ints).     

Sample data:    

```
Original DataFrame:    
attempts name qualify score    
0 1 Anastasia yes 12.50    
1 3 Dima no 9.10    
......    
8 2 Kevin no 8.80    
9 1 Jonas yes 19.13    
Data types of the columns of the said DataFrame:    
attempts int64    
name object    
qualify object    
score float64    
dtype: object    


Now change the Data type of 'score' column from float to int:    
attempts name qualify score    
0 1 Anastasia yes 12    
1 3 Dima no 9    
2 2 Katherine yes 16    
3 3 James no 12    
4 2 Emily no 9    
5 3 Michael yes 20    
6 1 Matthew yes 14    
7 1 Laura no 11    
8 2 Kevin no 8    
9 1 Jonas yes 19    
Data types of the columns of the DataFrame now:    
attempts int64    
name object    
qualify object    
score int64    
dtype: object    
    
```

In [28]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, 4, 9, 20, 14.5, 11, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data, columns=['attempts', 'name', 'qualify', 'score'], dtype=np.int)
df

   attempts       name qualify score
0         1  Anastasia     yes  12.5
1         3       Dima      no     9
2         2  Katherine     yes  16.5
3         3      James      no     4
4         2      Emily      no     9
5         3    Michael     yes    20
6         1    Matthew     yes  14.5
7         1      Laura      no    11
8         2      Kevin      no     8
9         1      Jonas     yes    19

In [29]:
df['score'] = df.score.apply(lambda x : int(x))
df

   attempts       name qualify  score
0         1  Anastasia     yes     12
1         3       Dima      no      9
2         2  Katherine     yes     16
3         3      James      no      4
4         2      Emily      no      9
5         3    Michael     yes     20
6         1    Matthew     yes     14
7         1      Laura      no     11
8         2      Kevin      no      8
9         1      Jonas     yes     19

# 52. Write a Pandas program to remove infinite values from a given DataFrame.     


Sample data:    

```
Original DataFrame:    
0    
0 1000.000000    
1 2000.000000    
2 3000.000000    
3 -4000.000000    
4 inf    
5 -inf    

Removing infinite values:    
0    
0 1000.0    
1 2000.0    
2 3000.0    
3 -4000.0    
4 NaN    
5 NaN    
```

In [30]:
df = pd.DataFrame([1000., 2000., 3000., -4000., np.infty, -np.infty])
df

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     inf
5    -inf

In [31]:
df.replace([np.infty, -np.infty], np.nan)

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN

# 53. Write a Pandas program to insert a given column at a specific column index in a DataFrame.   

Sample data:    

```
Original DataFrame    
col2 col3    
0 4 7    
1 5 8    
2 6 12    
3 9 1    
4 5 11    

New DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 12    
3 4 9 1    
4 7 5 11    
```

In [32]:
df = pd.DataFrame({'col2':np.random.randint(0,10,5),
                   'col3':np.random.randint(0,10,5)})
df

   col2  col3
0     5     4
1     6     2
2     0     0
3     7     3
4     6     3

In [33]:
df['col1'] = np.random.randint(0,10,5)
df

   col2  col3  col1
0     5     4     5
1     6     2     0
2     0     0     9
3     7     3     6
4     6     3     1

# 54. Write a Pandas program to convert a given list of lists into a Dataframe.     

Sample data:    

```
Original list of lists:    
[[2, 4], [1, 3]]    

New DataFrame    
col1 col2    
0 2 4    
1 1 3    
```

In [34]:
l = [[2, 4], [1, 3]] 
df = pd.DataFrame(l, columns=['col1', 'col2'])
df

   col1  col2
0     2     4
1     1     3

# ★ 55. Write a Pandas program to group by the first column and get second column as lists in rows.     

Sample data:    

```
Original DataFrame    
col1 col2    
0 C1 1    
1 C1 2    
2 C2 3    
3 C2 3    
4 C2 4    
5 C3 6    
6 C2 5    

Group on the col1:    
col1    
C1 [1, 2]    
C2 [3, 3, 4, 5]    
C3 [6]    

Name: col2, dtype: object    
```

In [35]:
df = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
df

  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5

In [36]:
df_groupby_col1 = df.groupby('col1')

In [37]:
for i in df_groupby_col1:
    print(i[0], i[1]['col2'].tolist())

C1 [1, 2]
C2 [3, 3, 4, 5]
C3 [6]

다른 정답

In [38]:
df = df.groupby('col1')['col2'].apply(list)
df

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

# 56. Write a Pandas program to get column index from column name of a given DataFrame.    

Sample Output:    

```
Original DataFrame    

col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 12    
3 4 9 1    
4 7 5 11    
Index of 'col2'    
1    
```

In [39]:
df = pd.DataFrame(np.random.randint(1,10,(5, 3)), columns=['col1','col2','col3'])
df

   col1  col2  col3
0     8     4     4
1     4     9     9
2     2     1     4
3     5     4     3
4     7     3     8

In [42]:
df.columns.tolist().index('col2')

1

다른 풀이

In [43]:
print(df.columns.get_loc("col2"))

1

# 57. Write a Pandas program to count number of columns of a DataFrame.     

Sample Output:    

```
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 12    
3 4 9 1    
4 7 5 11    

Number of columns:    
3    
```

In [47]:
df = pd.DataFrame(np.random.randint(1,10,(5, 3)), columns=['col1','col2','col3'])
df

   col1  col2  col3
0     1     5     3
1     5     1     1
2     4     7     3
3     7     3     1
4     9     1     9

In [51]:
len(df.columns)

3

# 58. Write a Pandas program to select all columns, except one given column in a DataFrame.  

Sample Output:    

```
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 8    
2 3 6 12    
3 4 9 1    
4 7 5 11    
All columns except 'col3':    
col1 col2    
0 1 4    
1 2 5    
2 3 6    
3 4 9    
4 7 5    
```

In [39]:
df = pd.DataFrame(np.random.randint(1,10,(5, 3)), columns=['col1','col2','col3'])
df

   col1  col2  col3
0     8     4     4
1     4     9     9
2     2     1     4
3     5     4     3
4     7     3     8

In [56]:
df.iloc[:,:-1]

   col1  col2
0     1     5
1     5     1
2     4     7
3     7     3
4     9     1

다른정답

In [60]:
df.loc[:, df.columns!='col3']

   col1  col2
0     1     5
1     5     1
2     4     7
3     7     3
4     9     1

# 59. Write a Pandas program to get first n records of a DataFrame.     

Sample Output:    


```
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 5    
2 3 6 8    
3 4 9 12    
4 7 5 1    
5 11 0 11    
First 3 rows of the said DataFrame':    
col1 col2 col3    
0 1 4 7    
1 2 5 5    
2 3 6 8    
```

In [39]:
df = pd.DataFrame(np.random.randint(1,10,(5, 3)), columns=['col1','col2','col3'])
df

   col1  col2  col3
0     8     4     4
1     4     9     9
2     2     1     4
3     5     4     3
4     7     3     8

In [62]:
df[:3]

   col1  col2  col3
0     1     5     3
1     5     1     1
2     4     7     3

In [63]:
df.head(3)

   col1  col2  col3
0     1     5     3
1     5     1     1
2     4     7     3

# 60. Write a Pandas program to get last n records of a DataFrame.     

```
Sample Output:    
Original DataFrame    
col1 col2 col3    
0 1 4 7    
1 2 5 5    
2 3 6 8    
3 4 9 12    
4 7 5 1    
5 11 0 11    

Last 3 rows of the said DataFrame':    
col1 col2 col3    
3 4 9 12    
4 7 5 1    
5 11 0 11
```

In [65]:
df = pd.DataFrame(np.random.randint(1,10,(5, 3)), columns=['col1','col2','col3'])
df

   col1  col2  col3
0     6     4     9
1     5     7     6
2     8     9     4
3     1     2     8
4     8     3     7

In [66]:
df[-3:]

   col1  col2  col3
2     8     9     4
3     1     2     8
4     8     3     7

In [67]:
df.tail(3)

   col1  col2  col3
2     8     9     4
3     1     2     8
4     8     3     7